
#### Terraform Format and Style 🖌`failure`
<details><summary>Format Output</summary>

```

rust.auto.tfvars
--- old/rust.auto.tfvars
+++ new/rust.auto.tfvars
@@ -1,2 +1,2 @@
 projectName = "rust"
-location = "eastus"
+location    = "eastus"
vm.tf
--- old/vm.tf
+++ new/vm.tf
@@ -39,7 +39,7 @@
   network_interface_ids = [
     azurerm_network_interface.rust.id,
   ]
-  priority = "Spot"
+  priority        = "Spot"
   eviction_policy = "Deallocate"
 
   admin_ssh_key {

```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key: Refreshing state... [id=afe54254fa2921f6f6aeaba2d2d378a690c215e6]
azurerm_resource_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust]
azurerm_virtual_network.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust]
azurerm_public_ip.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/publicIPAddresses/pip-rust]
azurerm_recovery_services_vault.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault]
azurerm_log_analytics_workspace.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.OperationalInsights/workspaces/rust-law]
azurerm_network_security_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkSecurityGroups/nsg-rust]
azurerm_subnet.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_subnet_network_security_group_association.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_network_interface.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkInterfaces/nic-rust]
azurerm_linux_virtual_machine.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Compute/virtualMachines/rust]
azurerm_backup_policy_vm.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupPolicies/rust-recovery-vault-policy]
azurerm_backup_protected_vm.vm1: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;rust;rust/protectedItems/VM;iaasvmcontainerv2;rust;rust]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_backup_protected_vm.vm1 must be replaced
-/+ resource "azurerm_backup_protected_vm" "vm1" {
      ~ id                  = "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;rust;rust/protectedItems/VM;iaasvmcontainerv2;rust;rust" -> (known after apply)
      ~ protection_state    = "Protected" -> (known after apply)
      ~ source_vm_id        = "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Compute/virtualMachines/rust" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_linux_virtual_machine.rust must be replaced
-/+ resource "azurerm_linux_virtual_machine" "rust" {
      ~ computer_name                                          = "rust" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      + eviction_policy                                        = "Deallocate" # forces replacement
      ~ id                                                     = "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Compute/virtualMachines/rust" -> (known after apply)
        name                                                   = "rust"
      ~ priority                                               = "Regular" -> "Spot" # forces replacement
      ~ private_ip_address                                     = "10.0.0.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.0.0.4",
        ] -> (known after apply)
      ~ public_ip_address                                      = "20.25.105.57" -> (known after apply)
      ~ public_ip_addresses                                    = [
          - "20.25.105.57",
        ] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
      ~ size                                                   = "Standard_B2als_v2" -> "Standard_D4as_v5"
      - tags                                                   = {} -> null
      ~ virtual_machine_id                                     = "829511fa-a0fe-49a0-90e7-c73b8b016391" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (13 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "rust_OsDisk_1_64f454fd96334e19815a2b5542e27ccb" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @robpitcher, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*